[VCP_BlitzStriker X2EncyclopediaTemplate]
ListTitle = "闪电突袭者"
DescriptionTitle = "闪电突袭者"
DescriptionEntry = "一位身法超凡的战士，双持手枪与利剑，以赤红闪电为引，发动无与伦比的迅疾攻势。他们穿梭于敌火交织的战场，释放电光迸射的轰击与毁灭性的近战斩击，而后如绯红风暴般骤然消隐"

[VCP_BlitzStriker X2SoldierClassTemplate]
DisplayName="闪电突袭者"
ClassSummary = "一位身法超凡的战士，双持手枪与利剑，以赤红闪电为引，发动无与伦比的迅疾攻势。他们穿梭于敌火交织的战场，释放电光迸射的轰击与毁灭性的近战斩击，而后如绯红风暴般骤然消隐"

;***************************************
;New Ability Descriptions
;***************************************

;Blitz Striker Ability
[VCP_BlitzMastery X2AbilityTemplate]
LocFriendlyName = "迅雷精通"
LocHelpText = " <Ability:ClassName/>能力随经验增长而提升."
LocLongDescription = " <Ability:ClassName/>能力随经验增长而提升."
LocPromotionPopupText = "<font color='#CA7200'>1级</font>获得<Ability:RANKNAME1/>等级 [1]<br/><Bullet/>获得<font color='#3ABD23'>枪斗术</font> - 警戒状态可赋予特殊行动点数，用于自动闪避敌方攻击。此外，还将获得双持手枪精通能力，从而抵消双持武器带来的负面效果.<br/><br/><font color='#CA7200'>2级</font>获得<Ability:RANKNAME3/>等级 [3]<br/><Bullet/>获得<font color='#3ABD23'>旋风换弹</font> - 换弹操作将赋予特殊行动点数，可在警戒状态下使用，从而在敌方回合自动完成换弹。此外，警戒状态不再强制结束己方回合.<br/><br/><font color='#CA7200'>3级</font>获得<Ability:RANKNAME5/>等级 [5]<br/><Bullet/>获得<font color='#3ABD23'>狂暴怒火</font> -若陷入精神异常状态，将进入狂怒状态并移除所有精神负面效果。同时获得暴击率加成，该暴击率随敌方损失的生命值比例提升.<br/><br/><font color='#CA7200'>4级</font>获得<Ability:RANKNAME7/>等级 [7]<br/><Bullet/>获得<font color='#3ABD23'>界限突破</font> -获得无限行动点数的使用权。但每超出3点行动点数，都将面临严重后果的风险."
